cask_args appdir: "/Applications"

# Setup cask and cask/versions for Java versions
tap "caskroom/cask"
tap "caskroom/versions"

# Java 8
cask "java8"

# Bash completion
brew "bash-completion"

# Packages
brew "vim"
cask "macvim"

# Ruby
brew "rbenv"
brew "ruby-build"

# Dependencies
brew "imagemagick"
brew "freetds"
brew "v8"

# Tools
brew "coreutils"
brew "git"
brew "htop"
brew "jq"
brew "lz4"
brew "ncdu"
brew "p7zip"
brew "sqlite"
brew "telnet"
brew "the_silver_searcher"
brew "tree"
brew "watch"
brew "wget"

# AWS
brew "awscli"

# Go
brew "go"

# Google
cask "google-cloud-sdk"

# Javascript
brew "node"

# Kubernetes
brew "kubernetes-cli"
brew "kubectx"
brew "kubernetes-helm"

# OPS tools
brew "packer"
brew "terraform"

# Java tools
brew "maven"
brew "sbt"

# Services
brew "redis",             restart_service: true
brew "mysql",             restart_service: true
brew "elasticsearch@2.4", restart_service: true

# GUI tools
cask "atom"
cask "chefdk"
cask "coconutbattery"
cask "cyberduck"
cask "docker-edge"
cask "flycut"
cask "gitx"
cask "google-chrome"
cask "intellij-idea-ce"
cask "iterm2"
cask "keystore-explorer"
cask "postman"
cask "quicklook-json"
cask "sequel-pro"
cask "slack"
cask "soapui"
cask "spotify"
cask "spotify-notifications"
cask "viscosity"
cask "wkhtmltopdf"

# Mac App store
mas "YubiKey Personalization Tool", id: 638161122
mas "Microsoft Remote Desktop 8.0", id: 715768417

# Yubikey
brew "ykman"
